In [1]:
from jupyter_dash import JupyterDash
import plotly.express as px
import plotly.graph_objects as go
import pandas as pd
from dash import dcc
from dash import html
from dash.dependencies import Input, Output

In [2]:
df = pd.read_pickle("all-names.pkl")

In [3]:
df = df.sort_values("year")

In [32]:
df.groupby("year").sum()

       number
year
1880   201484
1881   192691
1882   221533
1883   216944
1884   243461
...       ...
2016  3662277
2017  3568294
2018  3505963
2019  3455946
2020  3305259

[141 rows x 1 columns]

In [67]:
df.groupby("year").sum().loc["1880"].number

201484

In [41]:
df.head()

         year      name sex  number
1873258  1880    dayton   M       8
1872961  1880      vern   M      19
1872960  1880   stewart   M      19
1872959  1880  randolph   M      19
1872958  1880    lucien   M      19

In [42]:
yearsums = df.groupby("year").sum()

In [78]:
yearsums.rename(columns={"number": "total_births_estimate"}, inplace=True)

In [79]:
df = df.merge(yearsums, on="year")

In [80]:
df.head()

   year      name sex  number_x  number_y  total_births_estimate
0  1880    dayton   M         8    201484                 201484
1  1880      vern   M        19    201484                 201484
2  1880   stewart   M        19    201484                 201484
3  1880  randolph   M        19    201484                 201484
4  1880    lucien   M        19    201484                 201484

In [94]:
df["percent_of_births"] = 100 * df.number / df.total_births_estimate

In [95]:
df.head()

   year      name sex  number  total_births_estimate  percent_of_births
0  1880    dayton   M       8                 201484           0.003971
1  1880      vern   M      19                 201484           0.009430
2  1880   stewart   M      19                 201484           0.009430
3  1880  randolph   M      19                 201484           0.009430
4  1880    lucien   M      19                 201484           0.009430

In [104]:
APP_NAME = "tester8"
FAVORITES = ['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna', 'elina', 'jana', 'zora', 'azula']

In [101]:
# Build App
app = JupyterDash(__name__)
app.layout = html.Div([
    html.H1("Baby Names"),
    dcc.Graph(id=APP_NAME),
    html.Label([
        "names",
        dcc.Dropdown(
            id='names-dropdown', clearable=False,
            value=FAVORITES, options=[
                {'label': name, 'value': name}
                for name in sorted(list(set(df.name)))
            ],
            multi=True
        )
    ]),
    html.Label([
        "sex",
        dcc.Dropdown(
            id='sex-dropdown', clearable=False,
            value='F', options=[
                {'label': sex, 'value': sex}
                for sex in sorted(list(set(df.sex)))
            ]
        )
    ]),
])

In [102]:
# Define callback to update graph
@app.callback(
    Output(APP_NAME, 'figure'),
    [Input("names-dropdown", "value"),
    Input("sex-dropdown", "value")]
)
def update_graph(name_selection, sex_selection):
    print(name_selection)
    names = list()
    names.extend([name_selection])
    
    traces = list()
    for name in name_selection:
        name_df = df[(df["name"] == name) & (df["sex"] == sex_selection)]
        traces.append(go.Scatter(x=name_df.year,
                                 y=name_df.percent_of_births,
                                 name=name))
                                 
    
    #display_df = df[df["name"].isin(names)]
    
    return go.Figure(
        data=traces
    )

In [103]:
# Run app and display result inline in the notebook
app.run_server(mode='external')

Dash app running on http://127.0.0.1:8050/
['rachel', 'alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'brin', 'cypress', 'erin', 'lin', 'rain', 'eleanore']
['rachel', 'alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'cypress', 'erin', 'lin', 'rain', 'eleanore']
['rachel', 'alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'erin', 'lin', 'rain', 'eleanore']
['rachel', 'alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'erin', 'rain', 'eleanore']
['rachel', 'alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'rain', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'melody', 'sofia', 'ash', 'rain', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'ash', 'rain', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'ash', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'karen']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna', 'elina']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna', 'elina', 'jana']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna', 'elina', 'jana', 'zora']
['alta', 'mirabelle', 'lyra', 'serena', 'ella', 'edna', 'adie', 'daria', 'lilith', 'sofia', 'eleanore', 'lina', 'marina', 'phoenix', 'aurora', 'cora', 'maggie', 'amira', 'parker', 'juno', 'vienna', 'elina', 'jana', 'zora', 'azula']